In [108]:
import pandas as pd

In [109]:
import numpy as np
df = pd.DataFrame({
    "a": [4, 5, 6, 6, np.nan],
    "b": [7, 8, np.nan, 9, 9,],
    "c": [10, 11, 12, np.nan, 12]
},
    index = [1, 2, 3, 4, 5]
)

In [110]:
df

     a    b     c
1  4.0  7.0  10.0
2  5.0  8.0  11.0
3  6.0  NaN  12.0
4  6.0  9.0   NaN
5  NaN  9.0  12.0

In [111]:
df[(df.a > 4) & (df.c == 12)]

     a   b     c
3  6.0 NaN  12.0

In [112]:
df.describe()

              a         b          c
count  4.000000  4.000000   4.000000
mean   5.250000  8.250000  11.250000
std    0.957427  0.957427   0.957427
min    4.000000  7.000000  10.000000
25%    4.750000  7.750000  10.750000
50%    5.500000  8.500000  11.500000
75%    6.000000  9.000000  12.000000
max    6.000000  9.000000  12.000000

In [113]:
df

     a    b     c
1  4.0  7.0  10.0
2  5.0  8.0  11.0
3  6.0  NaN  12.0
4  6.0  9.0   NaN
5  NaN  9.0  12.0

In [114]:
df = df.drop_duplicates(keep='last')

In [115]:
df

     a    b     c
1  4.0  7.0  10.0
2  5.0  8.0  11.0
3  6.0  NaN  12.0
4  6.0  9.0   NaN
5  NaN  9.0  12.0

In [116]:
df[df['b'] != 7]

     a    b     c
2  5.0  8.0  11.0
3  6.0  NaN  12.0
4  6.0  9.0   NaN
5  NaN  9.0  12.0

In [117]:
df.a.isin([5,5])

1    False
2     True
3    False
4    False
5    False
Name: a, dtype: bool

In [118]:
df.isnull()

       a      b      c
1  False  False  False
2  False  False  False
3  False   True  False
4  False  False   True
5   True  False  False

In [119]:
pd.isnull(df)

       a      b      c
1  False  False  False
2  False  False  False
3  False   True  False
4  False  False   True
5   True  False  False

In [120]:
df['a'].isnull()

1    False
2    False
3    False
4    False
5     True
Name: a, dtype: bool

In [124]:
df.a.notnull()

1     True
2     True
3     True
4     True
5    False
Name: a, dtype: bool

In [133]:
df[df.b == 7] | df[df.b == 5]

    a   b   c
1 NaN NaN NaN